# Inequality Operator

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementId..::..Inequality Operator
ElementId Class See Also
---
Determines whether these two ElementIds are different.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool operator !=(
	ElementId first,
	ElementId second
)
```

Visual Basic
---
```text
Public Shared Operator <> ( _
	first As ElementId, _
	second As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool operator !=(
	ElementId^ first,
	ElementId^ second
)
```

# ### Parameters
first
    Type: Autodesk.Revit.DB..::..ElementIdThe first ElementId.
second
    Type: Autodesk.Revit.DB..::..ElementIdThe second ElementId.
# ### Return Value
True if the ElementIds are different; otherwise, false.
# See Also
ElementId Class
Autodesk.Revit.DB Namespace